{
  "1": {
    "government": "Switzerland practices direct democracy, allowing citizens to vote on laws directly. https://facts.net/society-and-social-sciences/society/40-facts-about-government/",
    "math": "Forty is the only number whose letters are in alphabetical order. https://whizz.com/blog/20-cool-facts-maths/",
    "science": "Bananas are slightly radioactive due to their potassium content. https://www.rd.com/list/science-facts-never-learned/",
    "history": "Napoleon was once attacked by bunnies during a rabbit hunt gone wrong. https://bestlifeonline.com/historical-facts/",
    "technology": "The first computer mouse was made of wood, invented in 1964. https://www.tech21century.com/interesting-fun-facts-about-technology/",
    "geography": "Mount Everest grows about 4 millimeters each year due to tectonic uplift. https://www.nationalgeographic.com/science/article/mount-everest-growth",
    "art": "Michelangelo painted the Sistine Chapel ceiling over four years using a unique fresco technique. https://www.britannica.com/biography/Michelangelo",
    "movies_and_tv": "The movie 'Avatar' was the first film to gross over $2 billion worldwide. https://www.boxofficemojo.com/title/tt0499549",
    "music": "The world's largest grand piano was built by a 15-year-old in New Zealand in 2010. https://www.guinnessworldrecords.com/world-records/largest-grand-piano",
    "gaming": "The term 'Easter egg' in gaming originated from a hidden credit in the 1979 Atari 2600 game 'Adventure.' https://www.atariage.com/2600/archives/Adventure",
    "random": "Octopuses have three hearts and blue blood. https://www.nationalgeographic.com/animals/invertebrates/facts/common-octopus"
  },
  "2": {
    "government": "Congress consists of the Senate and House of Representatives. https://en.wikipedia.org/wiki/United_States_Congress",
    "math": "Euler’s number, e, is approximately 2.718. https://en.wikipedia.org/wiki/E_%28mathematical_constant%29",
    "science": "Photosynthesis allows plants to create energy from sunlight. https://education.nationalgeographic.org/resource/photosynthesis/",
    "history": "Cleopatra wasn’t Egyptian—she was Greek, descended from Ptolemy. https://www.thefactsite.com/100-history-facts/",
    "technology": "The first webcam monitored a coffee pot at Cambridge University. https://randomfunfactsonline.com/interesting-it-facts-about-technology/",
    "geography": "Canada has the longest coastline of any country, stretching over 202,080 kilometers. https://www.worldatlas.com/articles/countries-with-the-most-coastline.html",
    "art": "The Mona Lisa has no eyebrows; it was common in the Renaissance for women to shave them off. https://www.louvre.fr/en/explore/the-palace/mona-lisa",
    "movies_and_tv": "The series finale of M*A*S*H in 1983 drew over 105 million viewers, the highest for any US TV episode. https://www.history.com/this-day-in-history/mash-series-finale",
    "music": "Beethoven continued to compose music even after he became completely deaf. https://www.britannica.com/biography/Ludwig-van-Beethoven",
    "gaming": "Minecraft began as a solo project by Markus Persson and was first released in 2009. https://www.minecraft.net/en-us/article/minecraft-10-year-anniversary",
    "random": "A group of flamingos is called a 'flamboyance.' https://www.nationalgeographic.com/animals/birds/facts/flamingo"
  },
  "3": {
    "government": "Estonia offers online voting, making it one of the most digitally advanced democracies. https://facts.net/society-and-social-sciences/society/40-facts-about-government/",
    "math": "A jiffy is a real unit of time, equal to 1/100th of a second. https://www.mathnasium.com/math-centers/hinsdale/news/10-math-facts-you-did-not-know",
    "science": "Lightning is hotter than the surface of the sun, reaching about 30,000 Kelvin. https://www.zmescience.com/feature-post/resources/metascience/10-quick-scientific-facts-will-blow-mind/",
    "history": "Stagecoach Mary was the first Black female U.S. postal worker and carried a rifle for protection. https://allthatsinteresting.com/history-facts",
    "technology": "The first text message ever sent said \"Merry Christmas\" in 1992. https://randomfunfactsonline.com/interesting-it-facts-about-technology/",
    "geography": "There are more than 2,000 distinct types of cacti found primarily in the Americas. https://www.britannica.com/plant/cactus",
    "art": "Salvador Dalí designed the melting 'soft watch' for the 1945 film 'Dreams That Money Can Buy.' https://www.theartstory.org/artist/dali-salvador/",
    "movies_and_tv": "'Gone with the Wind' (1939) won 10 Academy Awards, a record at the time. https://www.oscars.org/oscars/ceremonies/1939",
    "music": "The 'Amen break' is a 6-second drum solo from the song 'Amen, Brother' by The Winstons, sampled extensively across genres. https://www.bbc.com/culture/article/20160115-the-10-samples-that-changed-music",
    "gaming": "The PlayStation was originally conceived as a joint project between Nintendo and Sony. https://www.ign.com/articles/2008/03/25/the-creation-of-the-playstation-trilogy",
    "random": "Honey never spoils; edible honey was found in ancient Egyptian tombs. https://www.nationalgeographic.com/science/article/why-honey-doesnt-spoil"
  },
  "4": {
    "government": "Canada’s written constitution wasn’t patriated until 1982, almost a century after Confederation. https://en.wikipedia.org/wiki/Constitution_Act,_1982",
    "math": "Zero is the only number that cannot be represented in Roman numerals. https://www.mathsisfun.com/roman-numerals.html",
    "science": "Venus rotates in the opposite direction of most planets, making its day longer than its year. https://solarsystem.nasa.gov/planets/venus/overview/",
    "history": "Oxford University began teaching around 1096—more than 150 years before the Aztec civilization was founded. https://www.ox.ac.uk/about/organisation/history",
    "technology": "The first 1 GB hard drive, introduced by IBM in 1980, weighed over 500 pounds and cost $40 000. https://www.ibm.com/ibm/history/exhibits/storage/storage_4506.html",
    "geography": "Russia spans 11 time zones, the most of any country on Earth. https://www.worldatlas.com/articles/which-country-has-the-most-time-zones.html",
    "art": "Leonardo da Vinci painted the Mona Lisa on a poplar wood panel rather than canvas. https://www.louvre.fr/en/explore/the-palace/mona-lisa",
    "movies_and_tv": "The Wizard of Oz (1939) was the first Hollywood film broadcast on television in 1956. https://www.imdb.com/title/tt0032138",
    "music": "Jingle Bells became the first song ever broadcast from space, relayed by astronauts in 1965. https://www.nasa.gov/multimedia/imagegallery/image_feature_1954.html",
    "gaming": "The longest continuous Minecraft play marathon lasted 1760 hours (over 73 days). https://www.guinnessworldrecords.com/world-records/longest-marathon-playing-a-sandbox-video-game",
    "random": "A single day on Venus (243 Earth days) is longer than its year (225 Earth days). https://www.nasa.gov/venus"
  },
  "5": {
    "government": "Bhutan uses Gross National Happiness—measuring well-being and sustainability—instead of GDP. https://www.grossnationalhappiness.com/",
    "math": "A googol is 10^100, a number far greater than the estimated atoms in the observable universe. https://mathigon.org/course/number-alpha",
    "science": "Sharks have existed for around 400 million years, predating trees by over 50 million years. https://www.smithsonianmag.com/science-nature/sharks-tour-60075140/",
    "history": "Cleopatra lived closer in time to the first Moon landing (1969) than to the construction of the Great Pyramid (c. 2560 BC). https://www.history.com/news/cleopatra-facts",
    "technology": "There are more active mobile phone subscriptions globally than there are toothbrushes. https://www.zdnet.com/article/one-in-five-people-dont-own-a-toothbrush/",
    "geography": "Antarctica is the only continent without any native reptiles or snakes. https://www.antarctica.gov.au/about-antarctica/wildlife/",
    "art": "Salvador Dalí’s melting clocks in The Persistence of Memory were reportedly inspired by seeing Camembert cheese soften in the sun. https://www.moma.org/collection/works/79018",
    "movies_and_tv": "Toy Story (1995) was the first feature-length film made entirely with computer-generated imagery. https://www.pixar.com/feature-films/toy-story",
    "music": "The world’s largest theremin orchestra comprised 65 performers in Austria, 2019. https://www.guinnessworldrecords.com/world-records/largest-theremin-ensemble",
    "gaming": "Minecraft holds the record as the best-selling video game of all time, with over 240 million copies sold. https://www.minecraft.net/en-us/article/minecraft-10-year-anniversary",
    "random": "Wombat droppings are cube-shaped, preventing them from rolling away on sloped terrain. https://www.bbc.com/earth/story/20150323-why-pure-cubes-come-out-of-wombats"
  },
  "6": {
    "government": "Japan has the world’s oldest continuous hereditary monarchy, dating back to 660 BC. https://www.britannica.com/topic/emperor-of-Japan",
    "math": "A palindrome in mathematics is a number that reads the same forwards and backwards, like 121. https://www.mathsisfun.com/numbers/palindromic-numbers.html",
    "science": "Water can dissolve more substances than any other liquid, earning it the title “universal solvent.” https://www.nationalgeographic.com/science/article/water",
    "history": "The Hundred Years’ War actually lasted 116 years, from 1337 to 1453. https://www.britannica.com/event/Hundred-Years-War",
    "technology": "The World Wide Web was invented by Tim Berners-Lee in 1989. https://home.cern/article/1990/02/brief-history-web",
    "geography": "Russia is the largest country by land area, covering over 17 million square kilometers. https://www.worldatlas.com/articles/the-largest-countries-in-the-world.html",
    "art": "Leonardo da Vinci’s The Last Supper measures about 4.6 by 8.8 meters and is painted on a wall in Milan. https://www.britannica.com/topic/The-Last-Supper-by-Leonardo-da-Vinci",
    "movies_and_tv": "The Simpsons is the longest-running American sitcom, debuting in 1989. https://www.britannica.com/topic/The-Simpsons",
    "music": "The Beatles hold the record for the most number-one hits on the Billboard Hot 100 chart. https://www.billboard.com/articles/news/949094/the-beatles-top-billboard-hits",
    "gaming": "Tetris was created by Alexey Pajitnov in 1984 while working at the Soviet Academy of Sciences. https://www.britannica.com/topic/Tetris",
    "random": "Honey bees can recognize human faces. https://www.scientificamerican.com/article/bees-can-recognize-faces/"
  },
  "7": {
    "government": "Sweden’s parliament, the Riksdag, has 349 members. https://www.riksdagen.se/en/",
    "math": "A googolplex is 10 to the power of a googol, an almost unimaginably large number. https://www.mathsisfun.com/numbers/googolplex.html",
    "science": "Lightning strikes the Earth about 100 times every second. https://www.nationalgeographic.com/environment/article/lightning",
    "history": "Vlad the Impaler, also known as Dracula, ruled Wallachia in the 15th century. https://www.britannica.com/biography/Vlad-III-prince-of-Walachia",
    "technology": "The first smartphone, IBM Simon, was released in 1994. https://www.techrepublic.com/article/the-history-of-the-smartphone/",
    "geography": "The Nile River is the longest river in the world, stretching over 6,650 kilometers. https://www.britannica.com/place/Nile-River",
    "art": "Michelangelo carved the statue of David from a single block of marble. https://www.britannica.com/topic/David-sculpture-by-Michelangelo",
    "movies_and_tv": "Gone with the Wind (1939) won 10 Academy Awards. https://www.oscars.org/oscars/ceremonies/1939",
    "music": "Mozart composed over 600 works in his short lifetime. https://www.britannica.com/biography/Wolfgang-Amadeus-Mozart",
    "gaming": "The best-selling video game console of all time is the PlayStation 2, with over 155 million units sold. https://www.britannica.com/topic/PlayStation-2",
    "random": "A bolt of lightning is five times hotter than the surface of the sun. https://www.nasa.gov/lightning"
  },
  "8": {
    "government": "Australia’s parliament meets in Canberra, a city purpose-built as the national capital. https://www.aph.gov.au/About_Parliament/House_of_Representatives/About_the_House",
    "math": "The Fibonacci sequence appears in nature, such as the arrangement of sunflower seeds. https://www.mathsisfun.com/numbers/fibonacci-sequence.html",
    "science": "Rainbows are actually full circles; we see only an arc because the ground gets in the way. https://www.nasa.gov/mission_pages/hubble/science/rainbows.html",
    "history": "The Berlin Wall stood from 1961 to 1989, dividing East and West Berlin. https://www.britannica.com/topic/Berlin-Wall",
    "technology": "GPS became fully operational in 1995 with a constellation of 24 satellites. https://www.nasa.gov/directorates/heo/scan/communications/policy/GPS_History.html",
    "geography": "The Amazon Rainforest produces 20 percent of the Earth’s oxygen. https://www.worldwildlife.org/places/amazon",
    "art": "Pablo Picasso co-founded the Cubist movement in the early 20th century. https://www.britannica.com/biography/Pablo-Picasso",
    "movies_and_tv": "Titanic (1997) held the record for highest-grossing film for 12 years. https://www.boxofficemojo.com/title/tt0120338",
    "music": "Happy Birthday to You is the most recognized song in the English language. https://www.britannica.com/topic/Happy-Birthday-to-You",
    "gaming": "World of Warcraft, released in 2004, was the fastest-selling PC game. https://www.britannica.com/topic/World-of-Warcraft",
    "random": "The shortest commercial flight in the world lasts just 47 seconds, between two Scottish islands. https://www.guinnessworldrecords.com/world-records/shortest-commercial-flight"
  },
  "9": {
    "government": "The United Nations was founded in 1945 after World War II to promote peace. https://www.un.org/en/about-us/history",
    "math": "Zero factorial, 0!, is defined to be 1. https://www.mathsisfun.com/numbers/factorial.html",
    "science": "The human brain operates on about 20 watts of power, enough to light a dim bulb. https://www.livescience.com/29313-brain-power.html",
    "history": "The Titanic sank in 1912 after hitting an iceberg during its maiden voyage. https://www.britannica.com/topic/RMS-Titanic",
    "technology": "The first email was sent by Ray Tomlinson in 1971. https://www.invent.org/inductees/ray-tomlinson",
    "geography": "Mount Kilimanjaro is the highest free-standing mountain in the world at 5,895 meters. https://www.britannica.com/place/Kilimanjaro",
    "art": "The Starry Night by Vincent van Gogh was painted from his asylum room window. https://www.moma.org/collection/works/79802",
    "movies_and_tv": "Breaking Bad won 16 Primetime Emmys across its run. https://www.emmys.com/shows/breaking-bad",
    "music": "Billie Eilish became the youngest artist to win the Big Four Grammys in 2020. https://www.grammy.com/grammys/news/billie-eilish-youngest-ever-four-categories",
    "gaming": "Fortnite generated $9 billion in revenue in its first two years. https://www.statista.com/statistics/805646/fortnite-revenue-worldwide/",
    "random": "Dolphins have unique signature whistles to identify each other. https://www.nature.com/articles/nature08860"
  },
  "10": {
    "government": "Switzerland has 26 cantons, each with its own constitution and government. https://www.bfs.admin.ch/bfs/en/home.html",
    "math": "An icosagon is a polygon with 20 sides. https://www.mathsisfun.com/geometry/polygons.html",
    "science": "Light takes about 8 minutes and 20 seconds to travel from the Sun to Earth. https://www.nasa.gov/light",
    "history": "Joan of Arc led the French army to several victories during the Hundred Years’ War. https://www.britannica.com/biography/Saint-Joan-of-Arc",
    "technology": "The first commercial mobile phone call was made in 1973 by Martin Cooper of Motorola. https://www.britannica.com/technology/mobile-phone",
    "geography": "Canada has more lakes than the rest of the world’s lakes combined. https://www.britannica.com/place/Canada",
    "art": "Jackson Pollock pioneered the drip painting technique in the 1940s. https://www.moma.org/artists/4675",
    "movies_and_tv": "Friends held the record for highest-rated TV series finale for 17 years. https://www.emmys.com/news/awards-news/this-didnt-age-well-friends-finale",
    "music": "The most expensive musical instrument sold at auction was a Stradivarius violin for $15.9 million. https://www.sothebys.com/en/articles/most-expensive-violin-ever",
    "gaming": "The original Doom (1993) popularized the first-person shooter genre. https://www.britannica.com/topic/Doom-computer-game",
    "random": "There is a species of jellyfish that is biologically immortal. https://www.nationalgeographic.com/animals/article/immortal-jellyfish"
  },
  "11": {
    "government": "The U.S. Supreme Court has nine justices who serve lifetime appointments. https://www.supremecourt.gov/about/biographies.aspx",
    "math": "There are infinitely many prime numbers, a fact proven by Euclid around 300 BC. https://www.mathsisfun.com/prime-numbers.html",
    "science": "Humans share 98.8 percent of their DNA with chimpanzees. https://www.nature.com/articles/430147a",
    "history": "The Magna Carta was signed in 1215, limiting the power of the English king. https://www.britannica.com/topic/Magna-Carta",
    "technology": "Bluetooth technology is named after a 10th-century king, Harald Bluetooth. https://www.bluetooth.com/about-us/",
    "geography": "Mount Everest’s base camp is situated in Nepal at an altitude of about 5,364 meters. https://www.britannica.com/place/Mount-Everest",
    "art": "The Louvre in Paris is the world’s largest art museum, with over 380,000 objects. https://www.louvre.fr/en",
    "movies_and_tv": "Game of Thrones set a record for the most Emmy nominations for a scripted series. https://www.emmys.com/shows/game-thrones",
    "music": "The longest officially released song is “The Rise and Fall of Bossanova” at 13 hours, 23 minutes. https://www.guinnessworldrecords.com/world-records/longest-song",
    "gaming": "Pokémon is the highest-grossing media franchise of all time. https://www.statista.com/statistics/273963/pokemon-franchise-revenue-worldwide/",
    "random": "A snail can sleep for three years uninterrupted. https://www.nationalgeographic.com/animals/invertebrates/facts/garden-snail"
  },
  "12": {
    "government": "Finland was the first country to give women full political rights in 1906",
    "math": "A googol is 10^100, a one followed by one hundred zeros",
    "science": "A day on Venus is longer than a year on Venus",
    "history": "The shortest war ever was between Britain and Zanzibar, lasting just 38 minutes",
    "technology": "The first SMS text message was sent in 1992, simply reading “Merry Christmas”",
    "geography": "Canada has the longest coastline in the world at over 202,080 km",
    "art": "Leonardo da Vinci’s Mona Lisa has no eyebrows; they have faded away over time",
    "movies_and_tv": "The Wizard of Oz (1939) was the first Hollywood film broadcast on network television in 1956",
    "music": "Beethoven continued to compose masterpieces even after he lost all his hearing",
    "gaming": "The term “Easter egg” in video games comes from a hidden credit in the 1979 Atari game Adventure",
    "random": "Octopuses have three hearts and blue blood"
  },
  "13": {
    "government": "Switzerland has no single capital; its federal government meets in Bern",
    "math": "A “jiffy” is an actual unit of time, equal to one hundredth of a second",
    "science": "Bananas are slightly radioactive due to their content of potassium-40",
    "history": "Napoleon Bonaparte was once attacked by a horde of rabbits during a hunt gone wrong",
    "technology": "The first webcam was set up at Cambridge University to keep an eye on a coffee pot",
    "geography": "Istanbul is the only city in the world that straddles two continents, Europe and Asia",
    "art": "Salvador Dalí’s melting clocks were inspired by soft cheese melting in the sun",
    "movies_and_tv": "The 1997 film Titanic was the first to earn over $1 billion at the global box office",
    "music": "The “Amen break,” a six-second drum solo, is the most sampled music clip in history",
    "gaming": "Minecraft was created by Markus Persson in just six days before he expanded it into its full form",
    "random": "A flamboyance is the name for a group of flamingos"
  },
  "14": {
    "government": "Bhutan measures national success by Gross National Happiness instead of GDP",
    "math": "A polyglot number is a palindrome in multiple numeral systems",
    "science": "Honey never spoils; pottery jars of edible honey were found in ancient Egyptian tombs",
    "history": "Cleopatra wasn’t Egyptian by birth but descended from the Greek Macedonian Ptolemaic dynasty",
    "technology": "The first computer “bug” was a real moth trapped in a relay of the Harvard Mark II in 1947",
    "geography": "There’s a town called Hell in Norway—and it freezes over every winter",
    "art": "Michelangelo painted the Sistine Chapel ceiling while lying on his back for four years",
    "movies_and_tv": "Star Wars: The Empire Strikes Back was the first film to use a teaser trailer",
    "music": "Mozart composed over 600 works before his death at age 35",
    "gaming": "The PlayStation was originally conceived as a joint project between Sony and Nintendo",
    "random": "Octopuses can taste with their arms, thanks to taste receptors on their suckers"
  },
  "15": {
    "government": "Canada’s Charter of Rights and Freedoms was patriated in 1982, almost a century after Confederation",
    "math": "Zero is the only number that cannot be represented in Roman numerals",
    "science": "A teaspoon of honey represents the life’s work of about 12 bees",
    "history": "Oxford University began teaching in 1096, more than 150 years before the Aztec capital was founded",
    "technology": "The first hard disk drive, IBM’s 350 megabyte 305 RAMAC (1956), weighed over a ton",
    "geography": "Mount Everest grows by about 4 millimeters each year due to tectonic uplift",
    "art": "The Mona Lisa has no eyelashes, as it was fashionable for Renaissance women to shave them",
    "movies_and_tv": "Snow White and the Seven Dwarfs (1937) was the first full-length animated feature film",
    "music": "The world’s largest grand piano, over 18 feet long, was built in 2010 by a New Zealand teenager",
    "gaming": "Tetris was the first video game ever played in space on a Game Boy aboard the Mir station",
    "random": "Wombat droppings are cube-shaped to prevent them from rolling away"
  },
  "16": {
    "government": "In 2000, Chile became the first country to elect a female president, Michelle Bachelet",
    "math": "The birthday paradox: in a group of just 23 people, there’s over a 50% chance two share a birthday",
    "science": "Lightning strikes reach temperatures five times hotter than the surface of the sun",
    "history": "Napoleon once used a scorched-earth tactic in Russia, leading to the 1812 retreat disaster",
    "technology": "The first text message was sent by engineer Neil Papworth in 1992 to wish \"Merry Christmas\"",
    "geography": "Russia spans 11 time zones, more than any other country on Earth",
    "art": "Vincent van Gogh sold only one painting during his lifetime: The Red Vineyard",
    "movies_and_tv": "Avatar (2009) was the first film to earn over $2 billion at the global box office",
    "music": "Ludwig van Beethoven wrote his Ninth Symphony while almost completely deaf",
    "gaming": "Mario was originally called Jumpman in the 1981 arcade game Donkey Kong",
    "random": "Strawberries aren’t true berries, but bananas are"
  },
  "17": {
    "government": "The U.S. Constitution was the first written constitution to establish a federal government, in 1787",
    "math": "The Golden Ratio (φ ≈ 1.618) appears in nature, art, architecture, and even the proportions of the human body",
    "science": "Sharks have existed for about 400 million years, long before trees first appeared",
    "history": "On April 1, 1976, Apple Computer Co. was founded by Steve Jobs, Steve Wozniak, and Ronald Wayne",
    "technology": "Bluetooth technology is named after 10th-century Danish king Harald Bluetooth",
    "geography": "Alaska is both the westernmost and easternmost state in the U.S. because of the Aleutian Islands",
    "art": "Pablo Picasso could draw before he could walk, and his first word was “pencil,” in Spanish",
    "movies_and_tv": "Gone with the Wind (1939), adjusted for inflation, remains the highest-grossing film ever",
    "music": "The Beatles hold the record for the most #1 hits on the Billboard Hot 100 chart",
    "gaming": "The PlayStation 2 is the best-selling video game console of all time, with over 155 million units sold",
    "random": "Scotland’s national animal is the mythical unicorn"
  },
  "18": {
    "government": "Liechtenstein has no army; its last military engagement was in 1866, and it returned with more soldiers than it left with—thanks to friendly recruits.",
    "math": "The number 0.999... is mathematically equal to 1, a fact that often surprises even seasoned students.",
    "science": "The tardigrade, or water bear, can survive in space, extreme heat, freezing cold, and radiation.",
    "history": "The Library of Alexandria may have housed over 400,000 scrolls before its destruction, making it one of the largest ancient repositories of knowledge.",
    "technology": "The Apollo guidance computer had less processing power than a modern calculator, yet it successfully navigated astronauts to the Moon.",
    "geography": "The Amazon River once flowed in the opposite direction, toward the Pacific Ocean, before the Andes Mountains rose.",
    "art": "The color ultramarine was once more valuable than gold, made from crushed lapis lazuli imported from Afghanistan.",
    "movies_and_tv": "The original cut of 'The Shining' had a hospital scene that was removed after its first week in theaters.",
    "music": "The theremin is played without physical contact, using electromagnetic fields to control pitch and volume.",
    "gaming": "The original Legend of Zelda was inspired by creator Shigeru Miyamoto’s childhood explorations of forests and caves.",
    "random": "Sloths can hold their breath longer than dolphins—up to 40 minutes by slowing their heart rate."
  },
  "19": {
    "government": "San Marino claims to be the world’s oldest republic, founded in 301 AD and still governed by two elected Captains Regent.",
    "math": "The number 1729 is known as the Hardy–Ramanujan number, the smallest number expressible as the sum of two cubes in two different ways.",
    "science": "Some species of jellyfish are biologically immortal, capable of reverting to earlier life stages indefinitely.",
    "history": "The Eiffel Tower was originally intended to be dismantled after 20 years but was saved due to its usefulness as a radio antenna.",
    "technology": "The first computer mouse was made of wood and had only one button.",
    "geography": "Africa is the only continent situated in all four hemispheres—Northern, Southern, Eastern, and Western.",
    "art": "Banksy once shredded his own artwork moments after it was auctioned, increasing its value and notoriety.",
    "movies_and_tv": "The voice of Yoda was inspired by a combination of Albert Einstein and a Tibetan monk.",
    "music": "The world’s largest playable violin is over 14 feet long and requires multiple people to play.",
    "gaming": "The game 'Pong' was so simple that its original arcade machine broke because players lined up coins faster than it could process them.",
    "random": "Butterflies taste with their feet, using sensors to detect suitable plants for laying eggs."
  },
  "20": {
    "government": "The Icelandic parliament, the Althing, was established in 930 AD and is one of the oldest surviving legislative bodies in the world.",
    "math": "Graham’s number is so large that even if you wrote one digit per atom in the universe, you wouldn’t come close to finishing it.",
    "science": "The human nose can detect over 1 trillion different scents, far more than previously believed.",
    "history": "In 1978, a man legally declared his own micronation, the Republic of Molossia, within Nevada—and still maintains it today.",
    "technology": "The first email ever sent was by Ray Tomlinson in 1971, and it was a test message with no meaningful content.",
    "geography": "There’s a point in the ocean called Point Nemo that’s farther from land than any other location on Earth.",
    "art": "The Louvre was originally a fortress before becoming one of the world’s most famous art museums.",
    "movies_and_tv": "The sound of a lightsaber in Star Wars was created by blending the hum of an old projector with interference from a TV set.",
    "music": "John Cage’s composition '4′33″' consists of four minutes and thirty-three seconds of silence, challenging the definition of music.",
    "gaming": "The game 'E.T. the Extra-Terrestrial' for Atari was so poorly received that thousands of cartridges were buried in a New Mexico landfill.",
    "random": "The mantis shrimp can punch with the force of a bullet, and its eyes can see polarized light and 12 color channels."
  },
  "21": {
    "government": "The 21st Amendment to the U.S. Constitution repealed Prohibition in 1933.",
    "math": "21 is a triangular number: the sum of the first six positive integers (1+2+3+4+5+6).",
    "science": "The human brain generates around 20 watts of electricity — enough to power a light bulb.",
    "history": "In 1921, insulin was first used successfully to treat diabetes, saving countless lives.",
    "technology": "Unimate, created in 1961, was the first industrial robot, working on a GM assembly line.",
    "geography": "21% of the world’s freshwater is found in the Great Lakes of North America.",
    "art": "Pablo Picasso produced over 21,000 artworks during his lifetime.",
    "movies_and_tv": "The TV show '21 Jump Street' launched Johnny Depp’s career in the late '80s.",
    "music": "Adele’s album '21' became one of the best-selling records of the 21st century.",
    "gaming": "The game Blackjack is also known as '21' due to its highest achievable hand value.",
    "random": "21 is the legal drinking age in most U.S. states and a popular milestone birthday."
  },
  "22": {
    "government": "The G22 was an informal group of finance ministers and central bank governors formed in 1998 to address global economic instability.",
    "math": "22 divided by 7 is a common approximation of π, used for centuries before calculators.",
    "science": "Titan, Saturn’s largest moon, has over 22 lakes filled with liquid methane and ethane.",
    "history": "The 22nd Amendment to the U.S. Constitution limits presidents to two terms in office.",
    "technology": "The USB 2.0 specification was finalized in 2000, allowing transfer speeds up to 480 Mbps.",
    "geography": "With 22 official languages, India has one of the most linguistically diverse populations on Earth.",
    "art": "Artist Yayoi Kusama often uses repetitive dot patterns, famously creating 22-piece installations of mirrored infinity rooms.",
    "movies_and_tv": "Pixar’s 'Soul' featured a character named 22, a soul who refuses to be born on Earth.",
    "music": "Taylor Swift’s song '22' celebrates the carefree feeling of being twenty-two years old.",
    "gaming": "There are 22 tracks in the original 'Mario Kart 64,' including fan favorites like Rainbow Road.",
    "random": "Humans have 22 pairs of autosomal chromosomes, plus two sex chromosomes."
  },
  "23": {
    "government": "The 23rd Amendment, ratified in 1961, gave residents of Washington, D.C. the right to vote in presidential elections.",
    "math": "In a group of just 23 people, there's over a 50% chance that two share a birthday — known as the Birthday Paradox.",
    "science": "23 is the number of chromosomes each parent contributes to human DNA.",
    "history": "23 skidoo was a popular slang phrase in the early 1900s, meaning to get out quickly or leave.",
    "technology": "HTML 4.01, released in 1999, included 23 deprecated tags that were phased out in future versions.",
    "geography": "The Tropic of Capricorn is located at approximately 23.5° south latitude.",
    "art": "Jim Carrey starred in 'The Number 23,' a psychological thriller inspired by numerology obsession.",
    "movies_and_tv": "The show '23 Minutes to Sunrise' explores mysterious interactions between strangers before dawn.",
    "music": "Mike WiLL Made-It released a track titled '23' featuring Miley Cyrus, Wiz Khalifa, and Juicy J.",
    "gaming": "The Pokémon series introduced the 23rd Pokémon, Ekans, in Generation I — its name is 'snake' spelled backward.",
    "random": "The number 23 is often linked to conspiracy theories and synchronicity, famously popularized by the '23 enigma.'"
  },
  "24": {
    "government": "Greenland is an autonomous territory within the Kingdom of Denmark but has its own parliament and prime minister.",
    "math": "The factorial of 4 (4!) is 24 — meaning 4 × 3 × 2 × 1 = 24, often used in permutations.",
    "science": "Koalas have fingerprints that are almost indistinguishable from humans, even under a microscope.",
    "history": "In 24 BCE, Augustus was named Princeps Senatus, marking the consolidation of imperial power in Rome.",
    "technology": "The first known reference to 'cyberspace' appeared in William Gibson’s 1984 novel 'Neuromancer.'",
    "geography": "Mount Thor in Canada has the world’s greatest vertical drop — 4,101 feet straight down.",
    "art": "The surrealist painter Remedios Varo fled Francoist Spain and created her most famous works while living in Mexico.",
    "movies_and_tv": "The show '24' featured a real-time format, with each episode representing one hour of a single day.",
    "music": "The note A440 is the standard pitch for tuning musical instruments in Western music.",
    "gaming": "The original Xbox launched with only 24 titles in North America, including Halo and Project Gotham Racing.",
    "random": "Camels have three eyelids and two sets of eyelashes to protect their eyes from sandstorms."
  },
  "25": {
    "government": "The 25th Amendment to the U.S. Constitution outlines presidential succession and responses to disability.",
    "math": "25 is the square of 5 and the sum of two consecutive triangular numbers (10 + 15).",
    "science": "Jellyfish have survived five mass extinctions and are considered one of the oldest living animals.",
    "history": "The Library of Congress was founded in 1800 and now contains over 25 million cataloged books.",
    "technology": "Bluetooth operates using short-wavelength UHF radio waves in the 2.4 GHz ISM band.",
    "geography": "Lake Vostok in Antarctica is hidden beneath 2.5 miles of ice — one of the largest subglacial lakes in the world.",
    "art": "Claude Monet painted a series of 25 'Haystacks' to study the effects of light and atmosphere at different times.",
    "movies_and_tv": "The 25th James Bond film is 'No Time to Die,' released in 2021 after several delays.",
    "music": "Björk released an album titled 'Biophilia' which was packaged as a suite of interactive apps.",
    "gaming": "In 'Metal Gear Solid V,' there are 25 unique tapes that reveal backstory and hidden lore.",
    "random": "A group of crows is called a murder — but 25 crows together is sometimes jokingly dubbed a 'massacre.'"
  },
  "26": {
    "government": "New Zealand’s parliament includes seats specifically reserved for Māori representation, a practice dating back to 1867.",
    "math": "26 is the only number sandwiched between a square (25) and a cube (27).",
    "science": "The element iron has atomic number 26 and is essential for oxygen transport in blood via hemoglobin.",
    "history": "The Salem witch trials ended in 1693 after 26 people were convicted and executed for alleged witchcraft.",
    "technology": "The first widely used computer programming language, Fortran, was created in 1957 and is still used today.",
    "geography": "The Sahara covers roughly 26 percent of the African continent, making it the largest hot desert on Earth.",
    "art": "Japanese artist Yayoi Kusama once created 26 life-sized pumpkin sculptures as part of a traveling exhibition.",
    "movies_and_tv": "Disney’s 26th animated feature was 'The Great Mouse Detective' (1986), which revived interest in animation pre-Renaissance.",
    "music": "The musical alphabet has 7 letters, but most orchestras tune across 26 harmonic series to match concert pitch.",
    "gaming": "The original Pokédex in Generation I featured exactly 26 non-evolving Pokémon.",
    "random": "There are 26 letters in the English alphabet — a fact that underpins many trivia and word puzzles."
  },
  "27": {
    "government": "The United Nations was founded with 51 member states in 1945 — today there are 193.",
    "math": "27 is a cube number (3×3×3), and it's also the only positive integer that is 3 times the sum of its digits.",
    "science": "The mantis shrimp has the most complex eyes in the animal kingdom, seeing polarized light and 12 color channels.",
    "history": "The Rosetta Stone was discovered in 1799 and became key to deciphering Egyptian hieroglyphs.",
    "technology": "The first wearable computer was created in the 1960s to improve gambling odds in Las Vegas.",
    "geography": "Lake Tanganyika is the world’s longest freshwater lake — stretching over 676 km.",
    "art": "Georgia O’Keeffe was known for her abstract paintings of flowers, bones, and desert landscapes.",
    "movies_and_tv": "The movie '27 Dresses' starred Katherine Heigl as a perpetual bridesmaid — it became a cult rom-com hit.",
    "music": "The '27 Club' refers to a group of famous musicians who died at age 27, including Jimi Hendrix and Amy Winehouse.",
    "gaming": "The game 'Portal' was praised for its innovative physics-based puzzles and minimalistic storytelling.",
    "random": "There are 27 bones in the human hand — making it one of the most complex tools in the body."
  },
  "28": {
    "government": "The European Union began as the European Economic Community and now consists of 27 member states after the UK’s exit — it had 28 before Brexit.",
    "math": "28 is a perfect number — its divisors (1, 2, 4, 7, 14) add up to 28.",
    "science": "Octopuses have three hearts and can regenerate lost limbs, making them masters of survival.",
    "history": "In 1928, Alexander Fleming discovered penicillin by accident, revolutionizing medicine.",
    "technology": "The JPEG image format was introduced in 1992 to compress digital photographs — it remains widely used today.",
    "geography": "There are 28 states in India, each with distinct cultures, languages, and traditions.",
    "art": "The street artist Shepard Fairey created the iconic 'Hope' poster for Barack Obama’s 2008 campaign.",
    "movies_and_tv": "'28 Days Later' revived the zombie genre with fast-moving infected and psychological horror.",
    "music": "The standard piano keyboard has 88 keys, but 28 of those are typically black — arranged in repeating groups.",
    "gaming": "In 'Minecraft,' there are 28 hostile mobs across various biomes and dimensions.",
    "random": "February usually has 28 days, making it the shortest month of the Gregorian calendar."
  },
  "29": {
    "government": "The 29th President of the United States, Warren G. Harding, served from 1921 to 1923 before dying in office.",
    "math": "29 is a prime number and part of a twin prime pair with 31.",
    "science": "Neurons can transmit signals up to 120 meters per second — faster than a race car.",
    "history": "In 1929, the U.S. stock market crashed, marking the beginning of the Great Depression.",
    "technology": "The term “glitch” in technology is believed to come from the Yiddish word “glitsh,” meaning a slip.",
    "geography": "Mount Erebus in Antarctica is the southernmost active volcano on Earth.",
    "art": "The painting 'The Persistence of Memory' by Salvador Dalí, featuring melting clocks, was completed in 1931.",
    "movies_and_tv": "The movie 'Leap Year' revolves around a tradition observed on February 29th — a day that exists only every four years.",
    "music": "Composer Frédéric Chopin was born on March 1, 1810 — but some records say February 29th, adding a touch of mystery.",
    "gaming": "The game 'Bioshock' blends first-person shooting with philosophical storytelling and atmospheric world design.",
    "random": "29 is the number of days in February during leap years — which occur every four years."
  },
  "30": {
    "government": "In 1930, Turkey adopted the Latin alphabet for the Turkish language, replacing Arabic script as part of modernization reforms.",
    "math": "30 is the largest number such that all smaller numbers relatively prime to it (1, 7, 11, 13, 17, 19, 23, 29) add up to a perfect square: 210 = 14² + 14.",
    "science": "The Platypus has electroreceptors in its bill, allowing it to sense electric fields generated by prey underwater.",
    "history": "In 1930, Pluto was officially named — suggested by 11-year-old Venetia Burney of Oxford, England.",
    "technology": "In 1930, the first analog computer was developed to solve differential equations using rotating discs.",
    "geography": "The 30th meridian east passes through Russia, Ukraine, Turkey, Sudan, and Antarctica.",
    "art": "Frida Kahlo’s painting 'The Two Fridas' (1939) showcases duality and emotional trauma in Mexican surrealism.",
    "movies_and_tv": "The film '30 Days of Night' portrays a vampire siege on an Alaskan town during a month-long polar night.",
    "music": "Beethoven’s Piano Sonata No. 30 in E major was written during his late period and is known for its intricate variations.",
    "gaming": "In 'Super Mario Bros.', there are 30 coins in World 1-1 — a perfect run can collect all of them.",
    "random": "Some cicada species have synchronized life cycles that emerge every 13 or 17 years — creating 30-year overlap swarms in rare events."
  },
  "31": {
    "government": "The Thirty Years’ War (1618–1648) reshaped the political map of Europe and led to the rise of nation-states.",
    "math": "31 is a prime number and part of the Mersenne prime family — numbers of the form 2ⁿ − 1.",
    "science": "There are 31 recognized major human hormones that regulate processes from metabolism to mood.",
    "history": "In 1931, the Empire State Building was completed and held the title of tallest building in the world for nearly 40 years.",
    "technology": "IBM introduced its first mass-produced electronic typewriter, the IBM Model 01, in 1931.",
    "geography": "Latitude 31° north passes through the southern U.S., parts of Africa, India, and China.",
    "art": "The Salvador Dalí painting 'The Persistence of Memory,' completed in 1931, became an icon of surrealism.",
    "movies_and_tv": "The original 'Dracula' film starring Bela Lugosi premiered in 1931, launching Universal’s monster movie era.",
    "music": "In 1931, RCA Victor introduced the first commercial 33⅓ RPM long-play record — revolutionizing music storage.",
    "gaming": "In 'The Legend of Zelda: Breath of the Wild,' there are 31 types of fish that can be caught and cooked into meals.",
    "random": "On average, a human heart beats roughly 31 million times per year."
  }
}
